zephyrproject-rtos/hal_nuvoton/m55m1x/StdDriver/src/spi.c
/**************************************************************************//**
 * @file     spi.c
 * @version  V1.00
 * @brief    SPI driver source file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2022 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include "NuMicro.h"

/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup SPI_Driver SPI Driver
  @{
*/

/** @addtogroup SPI_EXPORTED_FUNCTIONS SPI Exported Functions
  @{
*/
static uint32_t SPII2S_GetSourceClockFreq(SPI_T *i2s);

/**
 * @brief Select PCLK as the clock source of SPI
 *
 * @return Actual frequency of SPI peripheral clock source.
 */
static void SPI_SetPCLKSrc(SPI_T *spi)
{
    uint32_t u32RegLockLevel = SYS_IsRegLocked();

    if (u32RegLockLevel)
    {
        /* Unlock protected registers */
        SYS_UnlockReg();
    }

    /* Select PCLK as the clock source of SPI */
    if (spi == SPI0)
    {
        /* Set the peripheral clock rate to equal APB clock rate */
        CLK->SPISEL = (CLK->SPISEL & (~CLK_SPISEL_SPI0SEL_Msk)) | CLK_SPISEL_SPI0SEL_PCLK0;
    }
    else if (spi == SPI1)
    {
        /* Set the peripheral clock rate to equal APB clock rate */
        CLK->SPISEL = (CLK->SPISEL & (~CLK_SPISEL_SPI1SEL_Msk)) | CLK_SPISEL_SPI1SEL_PCLK2;
    }
    else if (spi == SPI2)
    {
        /* Set the peripheral clock rate to equal APB clock rate */
        CLK->SPISEL = (CLK->SPISEL & (~CLK_SPISEL_SPI2SEL_Msk)) | CLK_SPISEL_SPI2SEL_PCLK0;
    }
    else if (spi == SPI3)
    {
        /* Set the peripheral clock rate to equal APB clock rate */
        CLK->SPISEL = (CLK->SPISEL & (~CLK_SPISEL_SPI3SEL_Msk)) | CLK_SPISEL_SPI3SEL_PCLK2;
    }

    if (u32RegLockLevel)
    {
        /* Lock protected registers */
        SYS_LockReg();
    }
}

/**
 * @brief Select PCLK as the clock source of SPI
 *
 * @return Actual frequency of SPI peripheral clock source.
 */
static uint32_t SPI_GetPCLKFreq(SPI_T *spi)
{
    uint32_t u32RetValue = 0;

    /* Select PCLK as the clock source of SPI */
    if (spi == SPI0)
    {
        /* Return slave peripheral clock rate */
        u32RetValue = CLK_GetPCLK0Freq();
    }
    else if (spi == SPI1)
    {
        /* Return slave peripheral clock rate */
        u32RetValue = CLK_GetPCLK2Freq();
    }
    else if (spi == SPI2)
    {
        /* Return slave peripheral clock rate */
        u32RetValue = CLK_GetPCLK0Freq();
    }
    else if (spi == SPI3)
    {
        /* Return slave peripheral clock rate */
        u32RetValue = CLK_GetPCLK2Freq();
    }

    return u32RetValue;
}

/**
 * @brief Check SPI Clock Source Frequency.
 *
 * @param spi       The pointer of the specified SPI module.
 * @return uint32_t Clock Frequency
 */
static uint32_t SPI_GetModuleClkSrcFreq(SPI_T *spi)
{
    uint32_t u32SPIClkSrcSel = 0ul;
    uint32_t u32RetValue = 0ul;

    /* Get SPI clock source selection */
    switch ((uint32_t)spi)
    {
        case (uint32_t)SPI0:
            u32SPIClkSrcSel = ((CLK->SPISEL & CLK_SPISEL_SPI0SEL_Msk) >> CLK_SPISEL_SPI0SEL_Pos);
            break;

        case (uint32_t)SPI1:
            u32SPIClkSrcSel = ((CLK->SPISEL & CLK_SPISEL_SPI1SEL_Msk) >> CLK_SPISEL_SPI1SEL_Pos);
            break;

        case (uint32_t)SPI2:
            u32SPIClkSrcSel = ((CLK->SPISEL & CLK_SPISEL_SPI2SEL_Msk) >> CLK_SPISEL_SPI2SEL_Pos);
            break;

        case (uint32_t)SPI3:
            u32SPIClkSrcSel = ((CLK->SPISEL & CLK_SPISEL_SPI3SEL_Msk) >> CLK_SPISEL_SPI3SEL_Pos);
            break;

        default:
            u32SPIClkSrcSel = SPI_CLKSEL_HXT;
            break;
    }

    switch (u32SPIClkSrcSel)
    {
        case SPI_CLKSEL_HXT:
            u32RetValue = __HXT;                            /* Clock source is HXT */
            break;

        case SPI_CLKSEL_APLL1_DIV2:
            u32RetValue = (CLK_GetAPLL1ClockFreq() >> 1);   /* Clock source is PLL */
            break;

        case SPI_CLKSEL_APLL0_DIV2:
            u32RetValue = (CLK_GetAPLL0ClockFreq() >> 1);   /* Clock source is PLL */
            break;

        case SPI_CLKSEL_PCLK2:
            u32RetValue = SPI_GetPCLKFreq(spi);             /* Clock source is PCLK */
            break;

        case SPI_CLKSEL_HIRC:
            u32RetValue = __HIRC;                           /* Clock source is HIRC 12Mhz */
            break;

        case SPI_CLKSEL_HIRC48M:
            u32RetValue = __HIRC48M;                        /* Clock source is HIRC 48Mhz */
            break;

        default:
            u32RetValue = __HXT;                            /* Clock source is HXT */
            break;
    }

    return u32RetValue;
}

/**
  * @brief  This function make SPI module be ready to transfer.
  * @param[in]  spi The pointer of the specified SPI module.
  * @param[in]  u32MasterSlave Decides the SPI module is operating in master mode or in slave mode. (SPI_SLAVE, SPI_MASTER)
  * @param[in]  u32SPIMode Decides the transfer timing. (SPI_MODE_0, SPI_MODE_1, SPI_MODE_2, SPI_MODE_3)
  * @param[in]  u32DataWidth Decides the data width of a SPI transaction.
  * @param[in]  u32BusClock The expected frequency of SPI bus clock in Hz.
  * @return Actual frequency of SPI peripheral clock.
  * @details By default, the SPI transfer sequence is MSB first, the slave selection signal is active low and the automatic
  *          slave selection function is disabled.
  *          In Slave mode, the u32BusClock shall be NULL and the SPI clock divider setting will be 0.
  *          The actual clock rate may be different from the target SPI clock rate.
  *          For example, if the SPI source clock rate is 12 MHz and the target SPI bus clock rate is 7 MHz, the
  *          actual SPI clock rate will be 6MHz.
  * @note   If u32BusClock = 0, DIVIDER setting will be set to the maximum value.
  * @note   If u32BusClock >= system clock frequency, SPI peripheral clock source will be set to APB clock and DIVIDER will be set to 0.
  * @note   If u32BusClock >= SPI peripheral clock source, DIVIDER will be set to 0.
  * @note   In slave mode, the SPI peripheral clock rate will be equal to APB clock rate.
  */
uint32_t SPI_Open(SPI_T *spi, uint32_t u32MasterSlave, uint32_t u32SPIMode, uint32_t u32DataWidth, uint32_t u32BusClock)
{
    uint32_t u32ClkSrc = 0U, u32Div, u32HCLKFreq, u32RetValue = 0U;

    /* Disable I2S mode */
    spi->I2SCTL &= ~SPI_I2SCTL_I2SEN_Msk;

